titanic datasını okuyunuz(<b>train.csv</b>). Ödevin geri kalanında dataframe gösterimlerini <b>display()</b> fonksiyonunu kullanarak yapınız.<br> Örn: display(titanic_df)

In [1]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
import numpy as np
import pandas as pd

df_titanic=pd.read_csv("train.csv")
display(df_titanic.head())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Soru 1:

Kazada ölenlerin yaş ortalamasını bulunuz

In [2]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[df_titanic["Survived"]==0]["Age"].mean()

30.62617924528302

Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

In [3]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
print("Ortalama :",df_titanic[(df_titanic["Survived"]==0)]["Fare"].mean())
print("Medyan :",df_titanic[(df_titanic["Survived"]==0)]["Fare"].median())

Ortalama : 22.117886885245877
Medyan : 10.5

Kazada ölen erkeklerin yaş ortalamasını bulunuz

In [4]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[(df_titanic["Survived"]==0)&(df_titanic["Sex"]=="male")]["Age"].mean()

31.618055555555557

Kazada ölen Kadınların yaş ortalamasını bulunuz

In [5]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[(df_titanic["Survived"]==0)&(df_titanic["Sex"]=="female")]["Age"].mean()

25.046875

# Soru 2:

Kazadan kurtulanların yaş ortalamasını bulunuz

In [6]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[df_titanic["Survived"]==1]["Age"].mean()

28.343689655172415

Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

In [7]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[(df_titanic["Survived"]==1)]["Fare"].mean()

48.39540760233917

Kazadan kurtulan toplam kişi sayısını bulunuz

In [8]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[df_titanic["Survived"]==1]["Survived"].sum()

342

Kazadan kurtulan erkeklerin yaş ortalamasını bulunuz

In [9]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[(df_titanic["Survived"]==1)&(df_titanic["Sex"]=="male")]["Age"].mean()

27.276021505376345

Kazadan kurtulan kadınların yaş ortalamasını bulunuz

In [10]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[(df_titanic["Survived"]==1)&(df_titanic["Sex"]=="female")]["Age"].mean()

28.84771573604061

# Soru 3:

10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

In [11]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[df_titanic["Age"]<10]["Fare"].median()

27.0

10 yaşından büyüklerin bilet fiyatlarının medyan değerini bulunuz

In [12]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic[df_titanic["Age"]>10]["Fare"].median()

13.92915

# Soru 5:

1.sınıf, 2.sınıf ve 3.sınıf yolcuların ölüm oranlarını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [13]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
print("1.Sınıfların Ölüm Oranı :",len(df_titanic[(df_titanic["Pclass"]==1)&(df_titanic["Survived"]==0)])/len(df_titanic[(df_titanic["Pclass"]==1)]))
print("2.Sınıfların Ölüm Oranı :",len(df_titanic[(df_titanic["Pclass"]==2)&(df_titanic["Survived"]==0)])/len(df_titanic[(df_titanic["Pclass"]==2)]))
print("3.Sınıfların Ölüm Oranı :",len(df_titanic[(df_titanic["Pclass"]==3)&(df_titanic["Survived"]==0)])/len(df_titanic[(df_titanic["Pclass"]==3)]))
print("-"*50)
print("Ölüm oranları 1.Sınıf < 2.Sınıf < 3.Sınıf şeklindedir.")

1.Sınıfların Ölüm Oranı : 0.37037037037037035
2.Sınıfların Ölüm Oranı : 0.5271739130434783
3.Sınıfların Ölüm Oranı : 0.7576374745417516
--------------------------------------------------
Ölüm oranları 1.Sınıf < 2.Sınıf < 3.Sınıf şeklindedir.

1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarını karşılaştırınız

In [14]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
print("1.Sınıfların Fiyat Ortalaması :",df_titanic[(df_titanic["Pclass"]==1)]["Fare"].mean())
print("2.Sınıfların Fiyat Ortalaması :",df_titanic[(df_titanic["Pclass"]==2)]["Fare"].mean())
print("3.Sınıfların Fiyat Ortalaması :",df_titanic[(df_titanic["Pclass"]==3)]["Fare"].mean())

1.Sınıfların Fiyat Ortalaması : 84.15468749999992
2.Sınıfların Fiyat Ortalaması : 20.66218315217391
3.Sınıfların Fiyat Ortalaması : 13.675550101832997

# Soru 6:

Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [15]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız. 
print("Kadınların Ölüm Oranı :",len(df_titanic[(df_titanic["Survived"]==0)&(df_titanic["Sex"]=="female")])/len(df_titanic[(df_titanic["Sex"]=="female")]))
print("Erkeklerin Ölüm Oranı :",len(df_titanic[(df_titanic["Survived"]==0)&(df_titanic["Sex"]=="male")])/len(df_titanic[(df_titanic["Sex"]=="male")]))
print("-"*50)
print("Erkeklerin ölüm oranı , kadınların ölüm oranından fazladır.")

Kadınların Ölüm Oranı : 0.25796178343949044
Erkeklerin Ölüm Oranı : 0.8110918544194108
--------------------------------------------------
Erkeklerin ölüm oranı , kadınların ölüm oranından fazladır.

# Soru 7:

Kazada ölen erkeklerin ortalama bilet fiyatı ile kurtulan erkeklerin ortalama bilet fiyatını karşılaştırınız. Bir veya bir kaç cümle ile sonucu <b>yorumlayınız.</b>

In [16]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
print("Ölen Erkeklerin Ortalama Bilet Fiyatı :",df_titanic[(df_titanic["Survived"]==0)&(df_titanic["Sex"]=="male")]["Fare"].mean())
print("Kurtulan Erkeklerin Ortalama Bilet Fiyatı :",df_titanic[(df_titanic["Survived"]==1)&(df_titanic["Sex"]=="male")]["Fare"].mean())
print("-"*50)
print("Kurtulan erkeklerin bilet fiyat ortalaması , ölen erkeklerin bilet fiyat ortalamasının yaklaşık 2 katı olacak şekilde fazladır.")

Ölen Erkeklerin Ortalama Bilet Fiyatı : 21.960992948717944
Kurtulan Erkeklerin Ortalama Bilet Fiyatı : 40.82148440366974
--------------------------------------------------
Kurtulan erkeklerin bilet fiyat ortalaması , ölen erkeklerin bilet fiyat ortalamasının yaklaşık 2 katı olacak şekilde fazladır.

# Missing Value Doldurma

Bundan sonraki soruları <b>train_missing.csv</b> datasını kullanarak cevaplayınız.

In [17]:
df_titanic_missing=pd.read_csv("train_missing.csv")
display(df_titanic_missing.head())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NaN

# Soru 8

Age, Embarked ve Fare değişkenlerini mean/median/mode değerlerini kullanarak değişken tipine uygun olacak şekilde doldurunuz.

In [18]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
df_titanic_missing["Age"].fillna(df_titanic_missing["Age"].mean(),inplace=True)
df_titanic_missing["Embarked"].fillna(df_titanic_missing["Embarked"].mode()[0],inplace=True)
df_titanic_missing["Fare"].fillna(df_titanic_missing["Fare"].median(),inplace=True)
display(df_titanic_missing.head())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,S

# Soru 9

SibSp değişkeni hangi yöntemler ile doldurulabilir, fikir yürütün. Uygun bir yöntem ile doldurun. (SibSp değişkeni kişilerin gemide bulunan kardeş/eş sayısını belirtiyor.)

In [19]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
print(df_titanic_missing["SibSp"].unique())
df_titanic_missing["SibSp"].fillna(df_titanic_missing["SibSp"].mode()[0],inplace=True)
display(df_titanic_missing.head(10))

[ 1.  0. nan  4.  3.  2.  5.  8.]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0.0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0.0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,29.699118,0.0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0.0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,0.0,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.000000,0.0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.000000,1.0,0,237736,30.0708,NaN,C

# Soru 10

Datayı baştan okuyun. Embarked değişkenini "NAN" şeklinde yeni bir kategorisi olacak şekilde doldurun.

In [20]:
df_titanic_missing=pd.read_csv("train_missing.csv")
df_titanic_missing["Embarked"].fillna("NAN",inplace=True)
display(df_titanic_missing.head(10))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,NaN,NAN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,NaN,NAN
5,6,0,3,"Moran, Mr. James",male,NaN,0.0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0.0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,NaN,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,NaN,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1.0,0,237736,30.0708,NaN,C

# Soru 11

"Fare" değişkeni için "Fare_Missing" adında yeni bir değişken türetip "Fare" değişkenini median ile doldurun.

In [21]:
# bu alana python kodunu yazıp çıktısı görülecek şekilde çalıştırınız
bos_index=df_titanic_missing[df_titanic_missing["Fare"].isnull()]["Fare"].index.to_list()
df_titanic_missing.insert(10,"Fare_Missing",0)
df_titanic_missing.loc[bos_index,"Fare_Missing"]=1
df_titanic_missing["Fare"].fillna(df_titanic_missing["Fare"].median(),inplace=True)
display(df_titanic_missing.head(10))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Fare_Missing,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0,A/5 21171,7.2500,0,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0,PC 17599,71.2833,0,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0,STON/O2. 3101282,7.9250,0,NaN,NAN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0,113803,53.1000,0,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0,373450,8.0500,0,NaN,NAN
5,6,0,3,"Moran, Mr. James",male,NaN,0.0,0,330877,8.4583,0,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0.0,0,17463,51.8625,0,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,NaN,1,349909,21.0750,0,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,NaN,2,347742,11.1333,0,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1.0,0,237736,30.0708,0,NaN,C